---
kind: property
id: P:Autodesk.Revit.DB.Analysis.MassSurfaceData.ShadeDepth
source: html/ba4db97e-3d36-b436-cf0b-69cb93013f67.htm
---
# Autodesk.Revit.DB.Analysis.MassSurfaceData.ShadeDepth Property

How far any auto-generated shades should extend from the wall surface.

## Syntax (C#)
```csharp
public double ShadeDepth { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The shade depth is less than zero.